SM_для_EDT/src/InformationRegisters/ТоварыДругогоКачества/ТоварыДругогоКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыДругогоКачества</name>
  <resources>
    <name>ГрадацияКачества</name>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураБрак</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/ГрадацииКачества/ГрадацииКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГрадацииКачества</name>
  <comment>makole ЗНИ РАIT-0023374</comment>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ОграниченноГоден</name>
  </enumValues>
  <enumValues>
    <name>НеГоден</name>
  </enumValues>
  <enumValues>
    <name>БУ</name>
    <comment>rarus makole РАIT-0023374</comment>
  </enumValues>
  <enumValues>
    <name>Восстановленный</name>
    <comment>rarus makole РАIT-0023374</comment>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/InformationRegisters/ТоварыДругогоКачества/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		ОтборНоменклатура = Параметры.Номенклатура;
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтборНоменклатура, Новый Структура("Качество"));
		ИмяЭлементаОтбора = ?(Реквизиты.Качество <> Перечисления.ГрадацииКачества.Новый, "НоменклатураБрак", "Номенклатура");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			ИмяЭлементаОтбора,
			ОтборНоменклатура,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
	Иначе
		ВызватьИсключение НСтр("ru = 'Список товаров другого качества можно посмотреть
		                             |только в форме номенклатуры.';
		                             |en = 'You can see the list of goods of other quality
		                             |only in the form of products.'");		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	Оповестить("Запись_ТоварыДругогоКачества", ОтборНоменклатура);
КонецПроцедуры

#КонецОбласти
